#include "led.h"
#include "delay.h"

/**************************************************************************
函数功能：Led灯初始化，配置PF9，PF10为推挽输出
入口参数：无
返回  值：无
**************************************************************************/
void Led_Init(void)
{
	RCC->AHB1ENR |= 1<<5;
	GPIO_Set(GPIOF, PIN9|PIN10, GPIO_MODE_OUT, GPIO_OTYPE_PP, GPIO_SPEED_100M, GPIO_PUPD_PU);
	LED1_OFF,LED2_OFF;  // led灯初始关闭
}

/**************************************************************************
函数功能：Led灯闪烁
入口参数：num:闪烁次数
返回  值：无
**************************************************************************/
void Led_Blink(u8 num)
{
	u8 i;
	for (i = 0; i < num; i++)
	{
		LED1_ON;
		delay_ms(100);
		LED1_OFF;
		delay_ms(100);
	}
}

/**************************************************************************
函数功能：Led灯做警告器
入口参数：无
返回  值：无
**************************************************************************/
void Led_Warning(void)
{
	u8 i;
	for (i = 0; i < 10; i++)
	{
		LED2 = !LED2;
		delay_ms(300);
	}
}

